viewsByHandRuby/app/views/records/new.html.erb

<%
r=Record.new(title:"Spamalot",artist:"Monty Python").save

@myRecord=Record.find(2)
---
INSERT INTO "records" ("title", "artist", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Spamalot"], ["artist", "Monty Python"], ["created_at", "2023-03-12 13:38:40.185388"], ["updated_at", "2023-03-12 13:38:40.185388"]]
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

<%
@myRecord=Record.find(2).destroy
---
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 1]]
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]