viewsByHandRuby/app/views/message/new.html.erb

INSERT INTO "messages" ("user", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user", "Daniel"], ["message", "Hello from "], ["created_at", "2023-03-12 13:28:31.184847"], ["updated_at", "2023-03-12 13:28:31.184847"]]
---
@message.message="Hello from "
@message.save

INSERT INTO "messages" ("user", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user", "Daniel"], ["message", "Hello again from "], ["created_at", "2023-03-12 13:31:50.326314"], ["updated_at", "2023-03-12 13:31:50.326314"]]
---
@message2=Message.new(message:"Hello again from ",user:"Daniel")
@message2.save