viewsByHandRuby/app/controllers/guest_books_controller.rb

  def index
    @guest_books = GuestBook.all
---
SELECT "guest_books".* FROM "guest_books"

  def create
    @guest_book = GuestBook.new(guest_book_params)

    respond_to do |format|
      if @guest_book.save
---
INSERT INTO "guest_books" ("user", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user", "hello"], ["message", "helllo"], ["created_at", "2023-03-04 09:08:41.480639"], ["updated_at", "2023-03-04 09:08:41.480639"]]

    def set_guest_book
      @guest_book = GuestBook.find(params[:id])
---
SELECT "guest_books".* FROM "guest_books" WHERE "guest_books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]